<a href="https://colab.research.google.com/github/MathildeBoccara/Business-Intelligence-and-Analytics/blob/master/week4%20-%20Visualization/Exercise2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Week 5 - SQL (1/2) - Exercice
First, we need to import the Python libraries we will need and do various setups.

In [ ]:
import pandas as pd
from sqlalchemy import create_engine
db = create_engine('sqlite://', echo=False)
csvfile = 'https://raw.githubusercontent.com/michalis0/Business-Intelligence-and-Analytics/master/data/artists%20(1).csv'
df = pd.read_csv(csvfile)
df.columns = map(str.lower, df.columns)
table_name = 'artists'
df.to_sql(table_name, con=db)

Now, let's take a first look at the data we will be working with.

In [ ]:
query = """
select * from artists
limit 5
"""
sql_df = pd.read_sql(query, con=db)
sql_df

   index  id  ...                                       wikipedia paintings
0      0   0  ...  http://en.wikipedia.org/wiki/Amedeo_Modigliani       193
1      1   1  ...  http://en.wikipedia.org/wiki/Wassily_Kandinsky        88
2      2   2  ...       http://en.wikipedia.org/wiki/Diego_Rivera        70
3      3   3  ...       http://en.wikipedia.org/wiki/Claude_Monet        73
4      4   4  ...      http://en.wikipedia.org/wiki/René_Magritte       194

[5 rows x 9 columns]

Each row contains a painter. We can see that the dataset contains the following information:
- **name**
- **years**: date of birth - date of death
- **genre**
- **nationality**
- **bio**
- **wikipedia**
- **paintings**: total number of paintings

### Questions
1. Find the names of all French artists and order them by alphabetical order

In [ ]:
query = """ 
select name
from artists
where artists.nationality like 'French'
order by name asc """
sql_df = pd.read_sql(query, con=db)
sql_df

                         name
0            Camille Pissarro
1                Claude Monet
2                 Edgar Degas
3               Edouard Manet
4            Eugene Delacroix
5              Georges Seurat
6             Gustave Courbet
7               Henri Matisse
8              Henri Rousseau
9   Henri de Toulouse-Lautrec
10               Paul Cezanne
11               Paul Gauguin
12      Pierre-Auguste Renoir

2. Find the total number of Italian artists.

In [ ]:
query = """ 
select count(id) 
from artists
where artists.nationality like 'Italian' """
sql_df = pd.read_sql(query, con=db)
sql_df.head()

   count(id)
0          8

3. Find the painter that was the most prolific.

In [ ]:
query = """ 
select name, max(paintings)
from artists """
sql_df = pd.read_sql(query, con=db)
sql_df.head()

               name  max(paintings)
0  Vincent van Gogh             877

4. Find the 5 genres that are the most represented. Display the genres and the respective number of artists representing them (as NumberOfRepresentants)

In [ ]:
query = """ 
select distinct genre, count(name) as NumberOfRepresentants
from artists 
group by genre
order by count(name) desc
limit 5
"""
sql_df = pd.read_sql(query, con=db)
sql_df

                  genre  NumberOfRepresentant
0               Baroque                     4
1         Impressionism                     4
2  Northern Renaissance                     4
3    Post-Impressionism                     4
4      High Renaissance                     3

5. Find all the artists whose name start by a 'P' and have painted more than 200 paintings

In [ ]:
query = """ 
select *
from artists
where name like'P%'
and paintings >= 200 
"""
sql_df = pd.read_sql(query, con=db)
sql_df

   index  id  ...                                          wikipedia paintings
0     13  13  ...         http://en.wikipedia.org/wiki/Pablo_Picasso       439
1     15  15  ...  http://en.wikipedia.org/wiki/Pierre-Auguste_Re...       336
2     46  46  ...          http://en.wikipedia.org/wiki/Paul_Gauguin       311

[3 rows x 9 columns]

6. Find the genres where the Total number of paintings is greater or equal than 1000.

In [ ]:
query = """ 
select distinct genre, sum(paintings) as TotalNumberOfPaintings
from artists
group by genre
having sum(paintings)>=1000
"""
sql_df = pd.read_sql(query, con=db)
sql_df

                genre  TotalNumberOfPaintings
0       Impressionism                    1370
1  Post-Impressionism                    1048

7. Find all the artists that where born after 1900. Display their names and their dates of birth and death.

In [ ]:
query = """ 
select name, years
from artists
where years like '19%' 
"""
sql_df = pd.read_sql(query, con=db)
sql_df

              name        years
0    Salvador Dali  1904 - 1989
1      Frida Kahlo  1907 - 1954
2      Andy Warhol  1928 – 1987
3  Jackson Pollock  1912 – 1956

8. Find all the artists that where born during the XVII century and are Spanish or Italian.

In [ ]:
query = """ 
select name, nationality, years
from artists
where years like '18%'
and nationality == 'Spanish'
or nationality == 'Italian' 
order by nationality
"""
sql_df = pd.read_sql(query, con=db)
sql_df

                name nationality        years
0  Amedeo Modigliani     Italian  1884 - 1920
1  Giotto di Bondone     Italian  1266 - 1337
2  Sandro Botticelli     Italian  1445 - 1510
3         Caravaggio     Italian  1571 - 1610
4  Leonardo da Vinci     Italian  1452 - 1519
5             Titian     Italian  1488 - 1576
6            Raphael     Italian  1483 – 1520
7       Michelangelo     Italian  1475 – 1564
8      Pablo Picasso     Spanish  1881 - 1973
9          Joan Miro     Spanish  1893 – 1983